<template>
  <div style="height: 100%;">
    <dv-border-box-6 :color="['#00FFFF', '#113069']">
      <div style="height: 100%;padding: 10px;">
        <dv-scroll-board :config="config" style="height: 100%;" />
      </div>
    </dv-border-box-6>
  </div>
</template>

<script>
export default {
  name: 'CenterBottom',
  data () {
    return {
      config: {
        headerBGC: '#0A2C5C',
        oddRowBGC: '#030C3B',
        evenRowBGC: '#030C25',
        columnWidth: [100], // 剩下列宽度将自动计算
        header: ['列1', '列2', '列3','列1', '列2', '列3'],
        data: [
          ['行1列1', '行1列2', '行1列3', '行1列1', '行1列2', '行1列3'],
          ['行2列1', '行2列2', '行2列3', '行1列1', '行1列2', '行1列3'],
          ['行3列1', '行3列2', '行3列3', '行1列1', '行1列2', '行1列3'],
          ['行4列1', '行4列2', '行4列3', '行1列1', '行1列2', '行1列3'],
          ['行5列1', '行5列2', '行5列3', '行1列1', '行1列2', '行1列3'],
          ['行6列1', '行6列2', '行6列3', '行1列1', '行1列2', '行1列3'],
          ['行7列1', '行7列2', '行7列3', '行1列1', '行1列2', '行1列3'],
          ['行8列1', '行8列2', '行8列3', '行1列1', '行1列2', '行1列3'],
          ['行9列1', '行9列2', '行9列3', '行1列1', '行1列2', '行1列3'],
          ['行10列1', '行10列2', '行10列3', '行10列1', '行10列2', '行10列3']
        ]
      }
    }
  }
}
</script>

<style>

</style>